In [2]:
import arrow
import pandas as pd
from datetime import datetime
import numpy as np

def convert_todate(df, column_name):
    data_series = []
    len_data = len(df[column_name])
    for idx in range(len_data):
        data = df[column_name].iloc[idx]
        try:
            at = arrow.get(data)
            date = at.date()
            data = date
        except: # jika NAN or NAT
            data = "0000-00-00"

        data_series.append(data)

    df[column_name] = data_series
    return df

In [3]:
df = pd.read_csv("../data/ASET_INSTALASI_JARINGAN.csv", sep='|', encoding='ISO-8859-1')

In [4]:
df.head()

,KODE_KL,NAMA_KL,KODE_KPKNL,NAMA_KPKNL,KODE_SATKER,NAMA_SATKER,KODE_SUB_SATKER,NAMA_SUB_SATKER,KELOMPOK,SUB_KELOMPOK,...,JUMLAH_FOTO,NO_PSP,TGL_PSP,STATUS_PENGELOLAAN,STATUS_PENGGUNAAN,JENIS_PENGGUNA,KD_SATKER_PENGGUNA,UR_SATKER_PENGGUNA,ALAMAT_SATKER_PENGGUNA,TGL_TARIK
0,60,KEPOLISIAN NEGARA RI,9101,KPKNL SEMARANG,060018200642644000KP,AKPOL,060018200642644000KP,AKPOL,INSTALASI LAIN,INSTALASI LAIN,...,0,NaN,NaN,NaN,Digunakan sendiri untuk operasional,NaN,NaN,NaN,NaN,20200226
1,60,KEPOLISIAN NEGARA RI,9101,KPKNL SEMARANG,060018200642644000KP,AKPOL,060018200642644000KP,AKPOL,INSTALASI LAIN,INSTALASI LAIN,...,0,NaN,NaN,NaN,Digunakan sendiri untuk operasional,NaN,NaN,NaN,NaN,20200226
2,60,KEPOLISIAN NEGARA RI,9101,KPKNL SEMARANG,060018200642644000KP,AKPOL,060018200642644000KP,AKPOL,INSTALASI LAIN,INSTALASI LAIN,...,0,NaN,NaN,NaN,Digunakan sendiri untuk operasional,NaN,NaN,NaN,NaN,20200226
3,60,KEPOLISIAN NEGARA RI,9101,KPKNL SEMARANG,060018200642644000KP,AKPOL,060018200642644000KP,AKPOL,INSTALASI LAIN,INSTALASI LAIN,...,0,NaN,NaN,NaN,Digunakan sendiri untuk operasional,NaN,NaN,NaN,NaN,20200226
4,60,KEPOLISIAN NEGARA RI,9101,KPKNL SEMARANG,060018200642644000KP,AKPOL,060018200642644000KP,AKPOL,INSTALASI LAIN,INSTALASI LAIN,...,0,NaN,NaN,NaN,Digunakan sendiri untuk operasional,NaN,NaN,NaN,NaN,20200226

In [5]:
df.columns

Index(['KODE_KL', 'NAMA_KL', 'KODE_KPKNL', 'NAMA_KPKNL', 'KODE_SATKER',
       'NAMA_SATKER', 'KODE_SUB_SATKER', 'NAMA_SUB_SATKER', 'KELOMPOK',
       'SUB_KELOMPOK', 'KODE_BARANG', 'NAMA_BARANG', 'NUP', 'NO_KIB',
       'TANGGAL_PEROLEHAN', 'TGL_BUKU', 'TGL_REKAM', 'TGL_REKAM_PERTAMA',
       'NILAI_PEROLEHAN_PERTAMA', 'NILAI_MUTASI', 'NILAI_PEROLEHAN',
       'NILAI_PENYUSUTAN', 'NILAI_BUKU', 'KONDISI', 'MERK', 'KUANTITAS',
       'NO_DANA', 'TGL_DANA', 'DARI', 'ASL_PERLH', 'TGL_PERLH', 'JUMLAH_FOTO',
       'NO_PSP', 'TGL_PSP', 'STATUS_PENGELOLAAN', 'STATUS_PENGGUNAAN',
       'JENIS_PENGGUNA', 'KD_SATKER_PENGGUNA', 'UR_SATKER_PENGGUNA',
       'ALAMAT_SATKER_PENGGUNA', 'TGL_TARIK'],
      dtype='object')

In [6]:
cname = ['TANGGAL_PEROLEHAN', 'TGL_BUKU', 'TGL_REKAM', 'TGL_REKAM_PERTAMA', 'TGL_DANA', 'TGL_PERLH', 'TGL_PSP',
         'TGL_TARIK']

In [7]:
len(cname)

8

In [8]:
df[cname[0]]

0       2010-10-19 00:00:00.0000000
1       2010-10-19 00:00:00.0000000
2       2010-10-19 00:00:00.0000000
3       2010-10-19 00:00:00.0000000
4       2010-10-19 00:00:00.0000000
                   ...
8379    2010-10-19 00:00:00.0000000
8380    2010-10-19 00:00:00.0000000
8381    2010-10-19 00:00:00.0000000
8382    2010-10-19 00:00:00.0000000
8383    2010-10-19 00:00:00.0000000
Name: TANGGAL_PEROLEHAN, Length: 8384, dtype: object

In [9]:
df = convert_todate(df, column_name=cname[0])
df[cname[0]]

0       2010-10-19
1       2010-10-19
2       2010-10-19
3       2010-10-19
4       2010-10-19
           ...
8379    2010-10-19
8380    2010-10-19
8381    2010-10-19
8382    2010-10-19
8383    2010-10-19
Name: TANGGAL_PEROLEHAN, Length: 8384, dtype: object

In [10]:
df[cname[1]]

0       2010-11-02 00:00:00.0000000
1       2010-11-02 00:00:00.0000000
2       2010-11-02 00:00:00.0000000
3       2010-11-02 00:00:00.0000000
4       2010-11-02 00:00:00.0000000
                   ...
8379    2010-11-02 00:00:00.0000000
8380    2010-11-02 00:00:00.0000000
8381    2010-11-02 00:00:00.0000000
8382    2010-11-02 00:00:00.0000000
8383    2010-11-02 00:00:00.0000000
Name: TGL_BUKU, Length: 8384, dtype: object

In [11]:
df = convert_todate(df, column_name=cname[1])
df[cname[1]]

0       2010-11-02
1       2010-11-02
2       2010-11-02
3       2010-11-02
4       2010-11-02
           ...
8379    2010-11-02
8380    2010-11-02
8381    2010-11-02
8382    2010-11-02
8383    2010-11-02
Name: TGL_BUKU, Length: 8384, dtype: object

In [12]:
df[cname[2]]

0       2010-11-02 00:00:00.0000000
1       2010-11-02 00:00:00.0000000
2       2010-11-02 00:00:00.0000000
3       2010-11-02 00:00:00.0000000
4       2010-11-02 00:00:00.0000000
                   ...
8379    2010-11-02 00:00:00.0000000
8380    2010-11-02 00:00:00.0000000
8381    2010-11-02 00:00:00.0000000
8382    2010-11-02 00:00:00.0000000
8383    2010-11-02 00:00:00.0000000
Name: TGL_REKAM, Length: 8384, dtype: object

In [13]:
df = convert_todate(df, column_name=cname[2])
df[cname[2]]

0       2010-11-02
1       2010-11-02
2       2010-11-02
3       2010-11-02
4       2010-11-02
           ...
8379    2010-11-02
8380    2010-11-02
8381    2010-11-02
8382    2010-11-02
8383    2010-11-02
Name: TGL_REKAM, Length: 8384, dtype: object

In [14]:
df[cname[3]]

0       2010-11-02 00:00:00.0000000
1       2010-11-02 00:00:00.0000000
2       2010-11-02 00:00:00.0000000
3       2010-11-02 00:00:00.0000000
4       2010-11-02 00:00:00.0000000
                   ...
8379    2010-11-02 00:00:00.0000000
8380    2010-11-02 00:00:00.0000000
8381    2010-11-02 00:00:00.0000000
8382    2010-11-02 00:00:00.0000000
8383    2010-11-02 00:00:00.0000000
Name: TGL_REKAM_PERTAMA, Length: 8384, dtype: object

In [15]:
df = convert_todate(df, column_name=cname[3])
df[cname[3]]

0       2010-11-02
1       2010-11-02
2       2010-11-02
3       2010-11-02
4       2010-11-02
           ...
8379    2010-11-02
8380    2010-11-02
8381    2010-11-02
8382    2010-11-02
8383    2010-11-02
Name: TGL_REKAM_PERTAMA, Length: 8384, dtype: object

In [16]:
df[cname[4]]

0      NaN
1      NaN
2      NaN
3      NaN
4      NaN
        ..
8379   NaN
8380   NaN
8381   NaN
8382   NaN
8383   NaN
Name: TGL_DANA, Length: 8384, dtype: float64

In [17]:
df = convert_todate(df, column_name=cname[4])
df[cname[4]]

0       0000-00-00
1       0000-00-00
2       0000-00-00
3       0000-00-00
4       0000-00-00
           ...
8379    0000-00-00
8380    0000-00-00
8381    0000-00-00
8382    0000-00-00
8383    0000-00-00
Name: TGL_DANA, Length: 8384, dtype: object

In [18]:
df[cname[5]]

0       2010-10-19 00:00:00.0000000
1       2010-10-19 00:00:00.0000000
2       2010-10-19 00:00:00.0000000
3       2010-10-19 00:00:00.0000000
4       2010-10-19 00:00:00.0000000
                   ...
8379    2010-10-19 00:00:00.0000000
8380    2010-10-19 00:00:00.0000000
8381    2010-10-19 00:00:00.0000000
8382    2010-10-19 00:00:00.0000000
8383    2010-10-19 00:00:00.0000000
Name: TGL_PERLH, Length: 8384, dtype: object

In [19]:
df = convert_todate(df, column_name=cname[5])
df[cname[5]]

0       2010-10-19
1       2010-10-19
2       2010-10-19
3       2010-10-19
4       2010-10-19
           ...
8379    2010-10-19
8380    2010-10-19
8381    2010-10-19
8382    2010-10-19
8383    2010-10-19
Name: TGL_PERLH, Length: 8384, dtype: object

In [20]:
df[cname[6]]

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
       ...
8379    NaN
8380    NaN
8381    NaN
8382    NaN
8383    NaN
Name: TGL_PSP, Length: 8384, dtype: object

In [21]:
df = convert_todate(df, column_name=cname[6])
df[cname[6]]

0       0000-00-00
1       0000-00-00
2       0000-00-00
3       0000-00-00
4       0000-00-00
           ...
8379    0000-00-00
8380    0000-00-00
8381    0000-00-00
8382    0000-00-00
8383    0000-00-00
Name: TGL_PSP, Length: 8384, dtype: object

In [23]:
 df[cname[7]]

0       20200226
1       20200226
2       20200226
3       20200226
4       20200226
          ...
8379    20200226
8380    20200226
8381    20200226
8382    20200226
8383    20200226
Name: TGL_TARIK, Length: 8384, dtype: int64

In [24]:
# declaration df to data variable
data = df
# declaration data series ('TGL_TARIK') to column_name
column_name = 'TGL_TARIK'

len_data = len(df)
# len_data = 10
data_series = []
for idx in range(len_data):
    len_data = len(df[column_name])
    data = df[column_name].iloc[idx]
    data = str(data)
    
    year = data[0:4]
    month = data[4:6]
    day = data[6:8]
    str_date = f'{year}-{month}-{day}'
#     print(str_date)

    try:
        at = arrow.get(str_date)
        date = at.date()
    except:
        str_date = f'0000-00-00'
#         at = arrow.get(str_date)
#         date = at.date()
        date = str_date
#         print(date)
#     print(date)

    data_series.append(date)

df[column_name] = data_series
df[column_name]
# return df

0       2020-02-26
1       2020-02-26
2       2020-02-26
3       2020-02-26
4       2020-02-26
           ...
8379    2020-02-26
8380    2020-02-26
8381    2020-02-26
8382    2020-02-26
8383    2020-02-26
Name: TGL_TARIK, Length: 8384, dtype: object

In [25]:
from sqlalchemy import create_engine

engine = create_engine('mysql://root:191618@localhost/db_logpolri')

In [26]:
df.to_sql('t_ASET_INSTALASI_JARINGAN', con=engine, if_exists='append', chunksize=500, index=False)